app/controllers/users_controller.rb

SELECT  `users`.* FROM `users` LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM `users`
---
  def index
    @users = User.paginate(page: params[:page])

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
SELECT  `microposts`.* FROM `microposts` WHERE `microposts`.`user_id` = 1 ORDER BY `microposts`.`created_at` DESC LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM `microposts` WHERE `microposts`.`user_id` = 1
---
  def show
    @user = User.find(params[:id])
    @microposts = @user.microposts.paginate(page: params[:page])

SELECT  `users`.* FROM `users` WHERE `users`.`id` IS NULL LIMIT 1
---
  def edit
    @user = User.find(params[:id])

INSERT INTO `users` (`name`, `email`, `created_at`, `updated_at`, `password_digest`) VALUES ('johncoff', 'foo@bar.com', '2017-03-11 00:52:37', '2017-03-11 00:52:37', '$2a$10$O8PXBDqZd2.meBUWLILxseySw.M0V7a4zmBRdixl/SI2yW1gJfFxO')
---
  def create
    @user = User.new(user_params)
    if @user.save

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
UPDATE `users` SET `password_digest` = '$2a$10$CQLezlJwUm8jcoj2lcYtPe7HKkyYeC/8F5v4b4q1PJopV868UpPNa', `updated_at` = '2017-03-12 00:37:18' WHERE `users`.`id` = 1
---
  def update
    @user = User.find(params[:id])
    if @user.update_attributes(user_params)

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
  def following
    @title = "Following"
    @user = User.find(params[:id])

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
  def followers
    @title = "Followers"
    @user = User.find(params[:id])